Repository: drgrice1/pg
Catalog: lib/WeBWorK/PG/Localize/*.po
Languages: el, he_il

source: %1 of the answers %plural(%1,has,have) been graded.
he_il: %1 מהתשובות %plural(%1,נבדק,נבדקו).

source: %1 of the answers %plural(%1,is,are) NOT correct.
el: %1 από τις απαντήσεις ΔΕΝ είναι %plural(%1,σωστή, σωστές).
he_il: %1 מהתשובות %plural(%1,אינה נכונה,אינן נכונות).

source: %1 of the answers will be graded later.
el: %1 από τις απαντήσεις θα βαθμολογηθούν αργότερα.
he_il: %1 מהתשובות ייבדקו בעתיד.

source: %1 with message
he_il: %1 עם הודעה

source: %1% correct
el: %1% σωστό
he_il: %1% נכון

source: %quant(%1,of the questions remains,of the questions remain) unanswered.
el: %quant(%1,των ερωτήσεων απομένει, των ερωτήσεων απομένουν) αναπάντητες.
he_il: %quant(%1, מהשאלות לא נענתה, מהשאלות לא נענו).

source: All of the answers are correct.
el: Όλες οι απαντήσεις είναι σωστές.
he_il: כל התשובות הן נכונות.

source: All of the computer gradable answers are correct.
he_il: כל התשובות הניתנות לבדיקה אוטומטית הן נכונות.

source: Answer Preview
he_il: תצוגה מקדימה של התשובות

source: Close
he_il: סגור

source: Correct
el: Σωστό
he_il: נכון

source: Correct Answer
el: Σωστή Απάντηση
he_il: תשובה נכונה

source: False
el: Λάθος
he_il: לא נכון

source: Get a new version of this problem
el: Λήψη νέας εκδοχής του προβλήματος
he_il: קבל גרסה חדשה של שאלה זו.

source: Go back to Part 1
el: Επιστροφή σε Μέρος 1
he_il: חזור לחלק 1

source: Go on to next part
el: Μετάβαση στο επόμενο
he_il: המשך לחלק הבא

source: Graded
he_il: נבדק

source: Hardcopy will always print the original version of the problem.
el: Στην έντυπη μορφή εμφανίζεται πάντα η αρχική μορφή του προβλήματος.
he_il: בקבצי הדפסה תמיד יודפס הגרסה המקורית של השאלה.

source: Hint
he_il: רמז

source: Hint:
el: Υπόδειξη:
he_il: רמז:

source: If you come back to it later, it may revert to its original version.
el: Αν επιστρέψετε αργότερα, ενδέχεται να επανέλθει στην αρχική του μορφή.
he_il: אם תחזור לשאלה בהמשך, ייתכן שהשאלה תחזור לגרסה המקורית.

source: Incorrect
el: Λάθος
he_il: לא נכון

source: Note:
el: Σημείωση:
he_il: הערה:

source: Preview
el: Προεπισκόπηση
he_il: תצוגה מקדימה

source: Preview of Your Answer
el: Προεπισκόπηση απάντησης
he_il: תצוגה מקדימה של התשובה שלך

source: Quick Entry
he_il: הזנה מהירה

source: Reveal
he_il: הצג

source: Set random seed to:
el: Ορισμός τυχαίου αριθμού:
he_il: החלף את זרע ההגרלות אל:

source: Solution
he_il: פתרון

source: Solution:
el: Απάντηση:
he_il: פתרון:

source: Submit your answers again to go on to the next part.
el: Υποβάλετε τις απαντήσεις σας ξανά για να συνεχίσετε.
he_il: שלח את התשובות שוב כדי להתקדם לחלק הבא.

source: The answer has been graded.
he_il: התשובה נבדקה

source: The answer is NOT correct.
el: Η απάντηση ΔΕΝ είναι σωστή.
he_il: התשובה איננה נכונה

source: The answer is correct.
el: Η απάντηση είναι σωστή!
he_il: התשובה נכונה

source: The answer will be graded later.
el: Η απάντηση θα βαθμολογηθεί αργότερα.
he_il: התשובה תבדק בהמשך

source: The question has not been answered.
el: Η ερώτηση δεν έχει απαντηθεί.
he_il: השאלה לא נענתה

source: This answer will be graded at a later time.
el: Η απάντηση θα βαθμολογηθεί αργότερα.
he_il: התשובה הזאת תבדק בעתיד

source: This is a new (re-randomized) version of the problem.
el: Αυτή είναι μια νέα (επανατυχαιοποιημένη) έκδοση του προβλήματος.
he_il: הנה גרסה חדשה של השאלה. (הוגרלו מספרים חדשים)

source: This problem contains a video which must be viewed online.
el: Αυτό το πρόβλημα περιέχει ένα βίντεο που πρέπει να προβληθεί στο διαδίκτυο.
he_il: השאלה מכילה וידיאו שיש לראות באופן מקוון.

source: This problem has more than one part.
el: Αυτό το πρόβλημα έχει περισσότερα από ένα μέρη.
he_il: לשאלה זו יש יותר מחלק אחד.

source: True
el: Σωστό
he_il: נכון

source: Ungraded
el: Χωρίς βαθμό
he_il: טרם נבדק

source: You Entered
el: Εισάγατε
he_il: הזנת

source: You can earn partial credit on this problem.
el: Μπορείτε να κερδίσετε μερική πίστωση σε αυτό το πρόβλημα.
he_il: ניתן לקבל ניקוד חלקי בשאלה זו

source: You can get a new version of this problem after the due date.
el: Μπορείτε να λάβετε νέα εκδοχή του προβλήματος μετά την ημερομηνία λήξης.
he_il: אתה יכול לבקש גרסה שונה של שאלה זו לאחר מועד ההגשה.

source: You may not change your answers when going on to the next part!
el: Μη δεκτές αλλαγές σε απαντήσεις αν συνεχίσετε στο επόμενο μέρος!
he_il: לא ניתן לשנות תשובות כאשר אתה מתקדם לחלק הבא!

source: Your browser does not support the video tag.
el: Ο περιηγητής σας δεν υποστηρίζει την ετικέτα βίντεο.
he_il: הדפדפן שלך לא תומך ב-video tag.

source: Your score for this attempt is for this part only;
el: Το σκορ σας σε αυτήν την προσπάθεια είναι μόνο για αυτό το μέρος˙
he_il: הציון שקבלת בהגשה זו הוא רק לחקל זה;

source: if
el: εάν
he_il: כאשר

source: otherwise
el: αλλιώς
he_il: אחרת

source: when you submit your answers
el: όταν υποβάλλετε τις απαντήσεις σας
he_il: כאשר אתה מגיש את תשובותיך

source: your overall score is for all the parts combined.
el: το συνολικό σκορ σας είναι για όλα τα μέρη μαζί.
he_il: הציון הכולל הוא על בסיס כל החלקים.
